import React from "react";
import { MainLayouts } from "../MainLayouts";
import { Checkbox } from "@mui/material";
import { useRouter } from "next/navigation";

const Consend = () => {
  const router = useRouter();
  return (
    <MainLayouts>
      <div
        style={{
          width: 712,
          padding: 24,
          background: "white",
          boxShadow: "0px 7px 16px rgba(194, 194, 194, 0.15)",
          borderRadius: 10,
          flexDirection: "column",
          justifyContent: "center",
          alignItems: "center",
          gap: 24,
          display: "inline-flex",
        }}
      >
        <div
          style={{
            alignSelf: "stretch",
            height: 40,
            justifyContent: "center",
            alignItems: "center",
            display: "inline-flex",
          }}
        >
          <div
            style={{
              color: "black",
              fontSize: 20,
              fontFamily: "Noto Sans Thai",
              fontWeight: "500",
              wordWrap: "break-word",
            }}
          >
            การให้ความยินยอมส่วนบุคคล
          </div>
        </div>
        <div
          style={{
            alignSelf: "stretch",
            flex: "1 1 0",
            justifyContent: "flex-start",
            alignItems: "flex-start",
            gap: 8,
            display: "inline-flex",
          }}
        >
          <div
            style={{
              width: 664,
              height: "calc(100vh - 300px)",
              alignSelf: "stretch",
              padding: 16,
              background: "#ECECEC",
              borderRadius: 8,
              overflowY: "auto",
              flexDirection: "column",
              justifyContent: "flex-start",
              alignItems: "flex-start",
              gap: 10,
              display: "inline-flex",
            }}
          >
            <div style={{ width: 615 }}>{`
            บริษัท ออริจิ้น พร็อพเพอร์ตี้ จำกัด (มหาชน) และบริษัทในเครือ ถือปฏิบัติอย่างเคร่งครัดว่าเรื่องความเป็นส่วนตัวของลูกค้าเป็นเรื่องสำคัญ และเราจะจัดเก็บ บันทึก ยึดถือ เก็บรักษา เปิดเผย โอน หรือใช้ข้อมูลส่วนตัวของท่าน เมื่อท่านใช้บริการต่างๆของเรา และเมื่อท่านเข้าสู่ www.origin.co.th ตามที่กำหนดไว้ด้านล่างนี้
การปกป้องรักษาข้อมูลเป็นเรื่องเกี่ยวกับความน่าเชื่อถือและความไว้วางใจ ความเป็นส่วนตัวของท่านถือเป็นเรื่องสำคัญของเรา เราจึงจะใช้ชื่อหรือข้อมูลอื่น ๆ ที่เกี่ยวข้องกับท่าน เพียงเฉพาะสำหรับกิจการที่ได้กำหนดไว้ในนโยบายความเป็นส่วนตัวนี้เท่านั้น เราจะจัดเก็บข้อมูลเพียงเท่าที่จำเป็นสำหรับการดำเนินการดังกล่าว และเราจะจัดเก็บเพียงข้อมูลที่เกี่ยวข้องกับการติดต่อทางธุรกิจระหว่างท่านกับเราเท่านั้นเราจะเก็บรักษาข้อมูลของท่านในระยะเวลาเพียงเท่าที่กฎหมายอนุญาตให้กระทำหรือในระยะเวลาเท่าที่จำเป็นสำหรับวัตถุประสงค์ของการจัดเก็บข้อมูลนั้น ๆท่านสามารถเข้าถึงหรือเยี่ยมชมแพลตฟอร์ม (Platform) (ตามความหมายที่ให้ไว้ในข้อตกลงการใช้บริการ) และเข้าหาข้อมูลในเวบไซต์ ของออริจิ้น และเลือกชมสินค้าโดยไม่จำเป็นต้องให้ข้อมูลส่วนตัวใด ๆ ระหว่างที่ท่านเยี่ยมชมแพลตฟอร์มสถานะของท่านจะไม่เป็นที่เปิดเผย และเราจะไม่สามารถระบุตัวตนของท่านได้ตลอดเวลาที่ท่านเข้าเยี่ยมชมแพลตฟอร์มเว้นแต่ท่านจะได้มีบัญชีบนแพลตฟอร์มและท่านได้เข้าสู่ระบบโดยใช้ชื่อบัญชีและรหัสผ่านหากท่านมีความคิดเห็น คำแนะนำหรือคำติชม ท่านสามารถติดต่อเรา (และเจ้าหน้าที่คุ้มครองข้อมูล) โดยทางโทรศัพท์ เบอร์ 020 300 000
การจัดเก็บข้อมูลส่วนตัว
เมื่อท่านสร้างบัญชีออริจิ้น หรือให้ข้อมูลส่วนตัวของท่านผ่านทางแพลตฟอร์ม ข้อมูลที่เราจัดเก็บอาจรวมถึงข้อมูลต่าง ๆ เหล่านี้ของท่าน
ชื่อ
อีเมล์
หมายเลขติดต่อ
หมายเลขโทรศัพท์เคลื่อนที่
ท่านจะต้องจัดส่งข้อมูลให้แก่เรา ตัวแทนผู้รับมอบอำนาจของเรา หรือจัดส่งเข้าสู่แพลตฟอร์มเท่านั้น และข้อมูลดังกล่าวจะต้องเป็นข้อมูลที่ ถูกต้องแท้จริง ครบถ้วน และไม่ทำให้เกิดความเข้าใจผิดใด ๆ ท่านจะต้องอัพเดทข้อมูลของท่านให้เป็นปัจจุบัน และแจ้งให้เราทราบเกี่ยวกับการเปลี่ยนแปลงข้อมูลต่าง ๆ (รายละเอียดตามที่จะได้กล่าวข้างล่าง) เราสงวนสิทธิที่จะร้องขอเอกสารเพิ่มเติมเพื่อตรวจสอบยืนยันว่าข้อมูลที่ท่านให้มานั้นถูกต้องเราจะสามารถจัดเก็บข้อมูลส่วนตัวของท่านหากท่านส่งมอบข้อมูลให้เราด้วยความสมัครใจของท่านเท่านั้น หากท่านเลือกจะไม่ส่งข้อมูลส่วนตัวของท่านให้แก่เราหรือเลือกที่จะเพิกถอนความยินยอมในการใช้ข้อมูลส่วนตัวของท่าน เราอาจไม่สามารถให้บริการของเราแก่ท่านได้ ท่านอาจจะต้องเข้าถึงและปรับเปลี่ยนข้อมูลส่วนตัวของท่านที่ท่านได้ส่งมอบให้เราได้ตลอดเวลาตามที่ได้กำหนดไว้ด้านล่างนี้หากท่านได้ส่งมอบข้อมูลของบุคคลภายนอกให้แก่เรา เราจะถือว่าท่านได้รับความยินยอมหรือได้รับอนุญาตจากบุคคลภายนอกผู้เกี่ยวข้องที่จะเปิดเผยและส่งมอบข้อมูลส่วนตัวนั้น ๆ แก่เราหากท่านสมัครเพื่อใช้งานออริจิ้นโดยผ่านทางบัญชีโซเชียลมิเดีย (Social Media) หรือเชื่อมต่อบัญชีออริจิ้นกับบัญชีโซเชียลมิเดียของท่าน หรือใช้บริการอื่น ๆ ของออริจิ้น เราอาจเข้าถึงข้อมูลเกี่ยวกับท่านที่ท่านได้ให้ไว้โดยสมัครใจกับบัญชีโซเชียลมิเดียของท่านผ่านทางผู้ให้บริการโซเชียลมิเดียรายนั้น ๆ ภายใต้นโยบายต่าง ๆ ของผู้ให้บริการ เราจะจัดการข้อมูลส่วนตัวของท่านที่ได้รับมาดังกล่าวตามนโยบายความเป็นส่วนตัวของออริจิ้น
การใช้และการเปิดเผยข้อมูลส่วนตัว
เราจะใช้ข้อมูลส่วนที่เราได้รับจากท่านหรือส่งต่อแก่บุคคลภายนอก (รวมถึงบริษัทที่เกี่ยวข้อง ผู้ให้บริการภายนอก ผู้ขายที่เป็นบุคคลภายนอก) เพื่อประโยชน์ของกิจการทั้งหมดหรือแต่บางส่วนดังจะได้กล่าวต่อไปนี้
เพื่อดำเนินการหรือสนับสนุนการใช้บริการ (Services) (ตามความหมายที่ได้ให้ไว้ในข้อตกลงการใช้บริการ) และ/หรือการใช้แพลตฟอร์ม
เพื่อดำเนินการตามคำสั่งซื้อของท่านที่ส่งผ่านทางแพลตฟอร์ม ไม่ว่าจะเป็นการขายสินค้าโดยออริจิ้นหรือผู้ขายที่เป็นบุคคลภายนอก การจ่ายเงินของท่านผ่านทางแพลตฟอร์มสำหรับสินค้า ไม่ว่าจะขายโดยออริจิ้นหรือผู้ขายที่เป็นบุคคลภายนอกจะถูกจัดการโดยตัวแทนของเรา
เพื่อแจ้งให้ท่านทราบเกี่ยวกับสินค้าและ สถานะการซื้อสินค้า ไม่ว่าจะขายผ่านแพลตฟอร์มโดยออริจิ้นหรือผู้ขายที่เป็นบุคคลภายนอก และเพื่อการบริการลูกค้าอื่น ๆ
เพื่อเปรียบเทียบข้อมูลและตรวจสอบกับบุคคลภายนอกเพื่อรับรองความถูกต้องของข้อมูล
ใช้ข้อมูลที่ท่านได้ส่งมอบให้เพื่อจัดการบัญชีการใช้งานของท่านที่ท่านมีกับเรา (ถ้ามี) เพื่อตรวจสอบและจัดการการธุรกรรมทางการเงินอันเกี่ยวกับการจ่ายเงินที่ท่านได้จัดทำขึ้นทางอินเตอร์เน็ตหรือออนไลน์ เพื่อตรวจสอบการดาวน์โหลดข้อมูลจากแพลตฟอร์ม เพื่อพัฒนาแผนผัง การจัดหน้าและเนื้อหาของหน้าต่าง ๆ ของแพลตฟอร์มและปรับแต่งสำหรับผู้ใช้ เพื่อระบุตัวตนผู้เข้าใช้ เพื่อการวิเคราะห์สถิติและพฤติกรรมของผู้ใช้ เพื่อจัดส่งข้อมูลที่เราคาดว่าท่านว่ามีประโยชน์สำหรับท่านหรือที่ท่านได้ร้องขอจากเราให้แก่ท่าน รวมถึงข้อมูลเกี่ยวกับสินค้าและบริการของเราและของผู้ขายที่เป็นบุคคลภายนอก เว้นแต่ท่านจะได้ปฎิเสธการติดต่อเพื่อวัตถุประสงค์ดังกล่าว
เมื่อท่านได้สมัครเพื่อเปิดบัญชีการใช้บริการกับออริจิ้นหรือได้ส่งมอบข้อมูลส่วนตัวของท่านผ่านทางแพลตฟอร์ม เราใช้ข้อมูลส่วนตัวของท่านเพื่อส่งข่าวสารทางการตลาดและโปรโมชั่นต่าง ๆ เกี่ยวกับสินค้าหรือบริการของเราหรือของผู้ขายที่เป็นบุคคลภายนอกเป็นครั้งคราว ท่านสามารถยกเลิกการรับข้อมูลการตลาดได้ตลอดเวลา โดยการใช้ระบบการยกเลิกการรับข้อมูลที่อยู่ในข้อมูลทางการตลาดที่จัดส่งให้ เราอาจใช้ข้อมูลการติดต่อของท่านเพื่อส่งเอกสารข่าวสารจากเราหรือจากบริษัทที่เกี่ยวข้องของเรา และ
ในกรณีที่เป็นข้อยกเว้นและออริจิ้นถูกขอให้เปิดเผยข้อมูลส่วนตัว เช่นในกรณีที่มีมูลให้เชื่อว่าการเปิดเผยดังกล่าวอาจป้องกันการข่มขู่ต่อชีวิตหรือร่างกาย สำหรับวัตถุประสงค์ในการบังคับใช้กฎหมาย หรือการปฏิบัติตามกฎหมาย ระเบียบ ข้อบังคับหรือการร้องขออื่นใด
ออริจิ้นอาจส่งมอบข้อมูลส่วนตัวของท่านให้แก่บุคคลภายนอกหรือบริษัทในเครือของเราสำหรับวัตถุประสงค์ดังกล่าวมาข้างต้น โดยเฉพาะอย่างยิ่งเพื่อดำเนินธุรกรรมต่าง ๆ กับท่านให้สำเร็จ จัดการบัญชีการใช้บริการของท่าน จัดการความสัมพันธ์อื่น ๆ กับท่าน การตลาด การปฏิบัติตามกฎหมาย ระเบียบข้อบังคับ การร้องขออื่นๆ ที่ออริจิ้นเห็นว่าจำเป็น ในการแบ่งปันข้อมูลให้แก่บุคคลดังกล่าว ออริจิ้นจะพยายามอย่างถึงที่สุดเพื่อรับรองว่าบุคคลภายนอกและบริษัทในเครือของเราจะรักษาและปกป้องข้อมูลส่วนตัวของท่านจากการเข้าถึง การจัดเก็บ การใช้ การเปิดเผย โดยไม่ได้รับอนุญาต หรือความเสี่ยงอื่น ๆ ในลักษณะเดียวกัน และจะต้องเก็บข้อมูลส่วนตัวของท่านในระยะเวลาเท่าที่จำเป็นสำหรับกิจการที่ได้กล่าวไว้ด้านบนนี้เท่านั้นออริจิ้นไม่เคยและไม่ได้ทำธุรกิจในการค้าข้อมูลส่วนตัวของลูกค้าแก่บุคคลภายนอก
การเพิกถอนความยินยอม
ท่านอาจส่งคำคัดค้านการใช้หรือการเปิดเผยข้อมูลส่วนตัวของท่านสำหรับกิจการต่าง ๆ หรือเพื่อวัตถุประสงค์ที่ระบุไว้ด้านบน แก่เราได้ตลอดเวลา โดยติดต่อเราผ่านทางอีเมล์ที่ระบุไว้ด้านล่างนี้ โปรดทราบว่าหากท่านได้ส่งคำคัดค้านการใช้หรือการเปิดเผยข้อมูลส่วนตัวของท่านสำหรับกิจการต่าง ๆ หรือเพื่อวัตถุประสงค์ที่ระบุไว้ด้านบน ขึ้นอยู่กับพฤติการณ์ของคำคัดค้าน เราอาจไม่อยู่ในสถานะที่จะจัดส่งสินค้าหรือบริการให้แก่ท่านหรือปฏิบัติตามสัญญาต่อท่านได้ เราขอสงวนสิทธิทางกฎหมายและการเยียวยาไว้โดยชัดแจ้งในกรณีซึ่งเราไม่สามารถจัดส่งสินค้าหรือบริการให้แก่ท่านหรือตามปฏิบัติตามสัญญาต่อท่านได้อันเกิดจากคำคัดค้านดังกล่าว
การอัพเดทหรือปรับเปลี่ยนข้อมูลส่วนตัวของท่าน
ท่านสามารถอัพเดทหรือปรับเปลี่ยนข้อมูลส่วนตัวของท่านได้ตลอดเวลาโดยการเข้าสู่บัญชีการใช้บริการของท่านบนแพลตฟอร์มของออริจิ้น หากท่านไม่มีบัญชีการใช้บริการกับเราท่านอาจทำการอัพเดทหรือปรับเปลี่ยนข้อมูลส่วนตัวได้โดยการติดต่อเราผ่านทางอีเมล์ที่เราได้ให้ไว้เราจะดำเนินการส่งข้อมูลส่วนตัวที่ได้รับการปรับเปลี่ยนแล้วแก่บริษัทในเครือที่เราได้แบ่งปันข้อมูลส่วนตัวของท่าน หากข้อมูลส่วนตัวของท่านยังคงจำเป็นต่อกิจการที่กล่าวไว้ข้างบน
ความปลอดภัยของข้อมูลส่วนตัวของท่าน
ออริจิ้นรับรองว่าข้อมูลที่จัดเก็บทั้งหมดจะถูกจัดเก็บอย่างปลอดภัย เราป้องกันข้อมูลส่วนตัวของท่านโดย
จำกัดการเข้าถึงข้อมูลส่วนตัว
จัดให้มีวิธีการทางเทคโนโลยีเพื่อป้องกันไม่ให้มีการเข้าสู่ระบบคอมพิวเตอร์ที่ไม่ได้รับอนุญาต
จัดการทำลายข้อมูลส่วนตัวของท่านเพื่อความปลอดภัยเมื่อข้อมูลดังกล่าวไม่จำเป็นสำหรับวัตถุประสงค์ทางกฎหมายและธุรกิจอีกต่อไป
หากท่านมีเหตุให้เชื่อว่าความเป็นส่วนตัวของท่านได้ถูกละเมิดโดยออริจิ้น กรุณาติดต่อเราผ่านทางอีเมล์ที่ระบุไว้ข้างล่างนี้รหัสผ่านของท่านเป็นกุญแจสำหรับบัญชีการใช้บริการของท่าน กรุณาใช้ตัวเลข ตัวอักษรหรือสัญลักษณ์ที่แตกต่างกัน และไม่แบ่งปันรหัสผ่านออริจิ้นแก่ผู้อื่น หากท่านได้แบ่งปันรหัสผ่านแก่ผู้อื่น ท่านจะรับผิดชอบต่อการกระทำต่าง ๆ ที่ได้กระทำลงในนามหรือผ่านทางบัญชีการใช้บริการของท่านและผลที่ตามมา หากท่านไม่สามารถควบคุมรหัสผ่านของท่านได้ ท่านอาจไม่สามารถควบคุมข้อมูลส่วนตัวของท่านหรือข้อมูลอื่น ๆ ที่ส่งให้แก่ออริจิ้นท่านอาจต้องยอมรับนิติกรรมใด ๆ ที่ทำลงในนามของท่าน ดังนั้นหากรหัสผ่านของท่านถูกเปิดเผยหรือไม่เป็นความลับอีกต่อไปไม่ว่าด้วยเหตุผลใด ๆ หรือท่านมีเหตุที่อาจเชื่อได้ว่ารหัสผ่านนั้นถูกเปิดเผยหรือไม่เป็นความลับอีกต่อไป ท่านควรที่จะติดต่อเราและเปลี่ยนรหัสผ่านของท่าน เราขอเตือนให้ท่านออกจากระบบบัญชีการใช้บริการ (log off) และปิดบราวเซอร์ (Browser) ทุกครั้งที่ท่านใช้คอมพิวเตอร์สาธารณะออริจิ้นหรือผู้ให้บริการที่ได้รับอนุญาตอาจจะใช้ โปรแกรมคุกกี้ (cookies) หรือโปรแกรมอื่น ๆ ที่คล้ายคลึงกันเพื่อจัดเก็บข้อมูล เพื่อช่วยให้เราสามารถจัดให้มีการบริการที่ดีขึ้น เร็วขึ้น ปลอดภัยขึ้น และเพื่อความเป็นส่วนตัวของท่าน เมื่อท่านใช้บริการ และ/หรือเข้าสู่แพลตฟอร์มเมื่อท่านเข้าเยี่ยมชมออริจิ้น เซิร์ฟเวอร์ (Servers) ของบริษัทเราทำการจดจำและบันทึกข้อมูลที่บราวเซอร์ของท่านส่งเข้ามาโดยอัตโนมัติเมื่อท่านเข้าเว็ปไซต์ของเรา ข้อมูลเหล่านี้อาจหมายรวมถึง
ที่อยู่ ไอพี แอดเดรส (IP address) ของคอมพิวเตอร์ของท่าน
ชนิดของบราวเซอร์ของท่าน
หน้าเว็ปไซต์ที่ท่านเข้าถึงก่อนที่ท่านจะเข้าสู่แพลตฟอร์ม
หน้าเว็ปไซต์ที่ท่านเข้าชมในแพลตฟอร์ม
จำนวนเวลาที่ท่านใช้ในการชมหน้าเว็ปไซต์ดังกล่าว สินค้าหรือข้อมูลที่ท่านค้นหาในแพลตฟอร์ม เวลาเข้าชมวันที่ และข้อมูลทางสถิติอื่นๆ
ข้อมูลต่าง ๆ เหล่านี้ จะถูกจัดเก็บเพื่อการวิเคราะห์และประเมินเพื่อช่วยให้เราพัฒนาแพลตฟอร์ม การบริการและสินค้าที่เราจัดหาให้ดีขึ้นโปรแกรมคุกกี้ (cookies) เป็นข้อมูลไฟล์ตัวอักษรขนาดเล็ก (โดยปกติจะมีเพียงตัวอักษรและตัวเลข) ที่จัดวางไว้บนหน่วยความจำของบราวเซอร์ของท่านหรือบนอุปกรณ์ของท่านเมื่อท่านเข้าชมเว็ปไซต์หรือเรียกดูข้อความ โปรแกรมนี้ช่วยให้เราจดจำอุปกรณ์หรือบราวเซอร์โดยจำเพาะได้ และช่วยให้เราสามารถจัดทำเนื้อหาให้เหมาะสมกับความสนใจส่วนบุคคลของท่านได้รวดเร็วขึ้น และช่วยให้การบริการและแพลตฟอร์มสะดวกสบายและเป็นประโยชน์ต่อท่านมากขึ้นคุณอาจจัดการและลบโปรแกรมคุกกี้ (COOKIES) ผ่านทางเบราว์เซอร์หรือการตั้งค่าอุปกรณ์ของคุณ สำหรับข้อมูลเพิ่มเติมเกี่ยวกับวิธีการดังกล่าวโปรดไปที่เนื้อหาวิธีการช่วยเหลือของเบราเซอร์หรืออุปกรณ์ของคุณ
            `}</div>
          </div>
        </div>
        <div
          style={{
            alignSelf: "stretch",
            justifyContent: "flex-start",
            alignItems: "center",
            gap: 24,
            display: "inline-flex",
          }}
        >
          <div
            style={{
              flex: "1 1 0",
              height: 25,
              justifyContent: "flex-start",
              alignItems: "center",
              gap: 8,
              display: "flex",
            }}
          >
            <Checkbox
              sx={{
                color: "#D9D9D9",
                "&.Mui-checked": {
                  color: "#1976d2",
                },
              }}
            />
            <div
              style={{
                color: "rgba(0, 0, 0, 0.85)",
                fontSize: 18,
                fontFamily: "Noto Sans Thai",
                fontWeight: "400",
                wordWrap: "break-word",
              }}
            >
              ยินยอม
            </div>
          </div>
          <div
            style={{
              width: 241,
              height: 48,
              paddingLeft: 16,
              paddingRight: 16,
              background: "#4100F4",
              borderRadius: 10,
              justifyContent: "center",
              alignItems: "center",
              gap: 8,
              display: "flex",
              cursor: "pointer",
            }}
            onClick={() => {
              console.log("clicked");
              router.push("/form");
            }}
          >
            <div
              style={{
                width: 44,
                justifyContent: "center",
                alignItems: "center",
                gap: 8,
                display: "flex",
              }}
            >
              <div
                style={{
                  color: "white",
                  fontSize: 18,
                  fontFamily: "Noto Sans Thai",
                  fontWeight: "400",
                  wordWrap: "break-word",
                }}
              >
                ยืนยัน
              </div>
            </div>
          </div>
        </div>
      </div>
    </MainLayouts>
  );
};

export default Consend;
